<?php
return [

    'application' => [ 'status' => [ '承認待ち'=>'承認待ち', '承認'=>'承認', '休暇取得完了' => '休暇取得完了', '却下' => '却下', '取り下げ' => '取り下げ' ], 
                       'type'   => [ '有給休暇' => '有給休暇', '特別休暇' => '特別休暇' ],
                       
                       'class'  => [ 
                           'status'    => [ '承認待ち'=>'bg-info', '承認'=>'bg-primary', '休暇取得完了' => 'bg-success', '却下' => 'bg-danger', '取り下げ' => 'bg-gray'  ],
                           'bg_status' => [ '承認待ち'     => 'bg_application', 
                                            '承認'         => 'bg_approved', 
                                            '休暇取得完了' => 'bg_processed', 
                                            '却下'         => 'bg_rejected', 
                                            '取り下げ'     => 'bg_dropped',  ]
                                    ], 
                        'forSelectForm' => [ 'type' => ['' => '-','有給休暇' => '有給休暇', '特別休暇' => '特別休暇'] 
                        
                                        ],

                    ],
    'user'          => [ 'grade' => [ 'officer' => ['社長', '会長', '取締役', '代表取締役', '執行役員' ],
                         
                                    ],
                        ],

    'authority'     => [ 'browsing' => ['自分のみ' => '自分のみ', '部内'=>'部内', '全社' => '全社' ],

                        ],

    'paidleave'     => [ 'hourly' => [ '0.125' => '1時間',  '0.25' => '2時間',  '0.375' => '3時間', '0.5' =>  '4時間',  '0.625' => '5時間',  '0.75' => '6時間', '0.875' => '7時間'  ]],

    'aaa' => [ 1,2, 3],

];